app/controllers/comentarios_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
INSERT INTO "comentarios" ("texto", "compartir", "likes", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["texto", "Hola"], ["compartir", 0], ["likes", 0], ["post_id", 6], ["created_at", "2020-05-10 23:39:11.669787"], ["updated_at", "2020-05-10 23:39:11.669787"]]
---
    def create
        @post = Post.find(params[:post_id])
        @comentario = @post.comentarios.create(comentario_params)

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
SELECT "comentarios".* FROM "comentarios" WHERE "comentarios"."post_id" = ? AND "comentarios"."id" = ? LIMIT ?  [["post_id", 7], ["id", 2], ["LIMIT", 1]]
DELETE FROM "comentarios" WHERE "comentarios"."id" = ?  [["id", 2]]
---
      def destroy
        @post = Post.find(params[:post_id])
        @comentario = @post.comentarios.find(params[:id])
        @comentario.destroy