app/controllers/posts_controller.rb

  def index
    @posts = Post.order('created_at DESC')
---
SELECT "posts".* FROM "posts" ORDER BY created_at DESC

  def create
    @post = Post.new(post_params)
    @post.update_attribute(:cloned, 0)
    post_ids_on_top = [10, 12, 13, 20]
    posts = Post.all
    top_posts = posts.select{|post| post_ids_on_top.include?(post.compartir) }
    bottom_posts = posts.reject{|post| post_ids_on_top.include?(post.compartir) }

    @posts = top_posts + bottom_posts
    respond_to do |format|
      @post.user = User.first
      if @post.save
---
SELECT "posts".* FROM "posts"
SELECT "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT ?  [["LIMIT", 1]]
INSERT INTO "posts" ("texto", "compartir", "likes", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["texto", "trhe"], ["compartir", 0], ["likes", 0], ["created_at", "2020-05-12 17:28:21.338554"], ["updated_at", "2020-05-12 17:28:21.338554"], ["user_id", 2]]

  def update
    @post = Post.find(params[:id])
    auxiliar = @post.texto
    if @post.update(post_params)
      Post.where(texto: auxiliar).update_all(texto: @post.texto)
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "posts" SET "texto" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["texto", "Primer Dibb"], ["updated_at", "2020-05-12 20:20:17.183924"], ["id", 1]]
UPDATE "posts" SET "texto" = ?, "compartir" = ?, "likes" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["texto", "Dibb"], ["compartir", 0], ["likes", 0], ["updated_at", "2020-05-12 20:19:47.202838"], ["id", 1]]

  def destroy
    @post = Post.find(params[:id])
    auxiliar = @post.texto
    Post.where(:texto => auxiliar).destroy_all
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT "posts".* FROM "posts" WHERE "posts"."texto" = ?  [["texto", "Tercer Dibb"]]
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 3]]

  def update_like
    post = Post.find_by(id: params[:id])
    post.increment!(:likes,  1)
    auxiliar = post.texto
    Post.where(texto: auxiliar).update_all(likes: post.likes)
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "posts" SET "likes" = COALESCE("likes", 0) + ? WHERE "posts"."id" = ?  [["likes", 1], ["id", 2]]
UPDATE "posts" SET "likes" = ? WHERE "posts"."texto" = ?  [["likes", 7], ["texto", "Tercer Dibb"]]

  def update_redibbs
    post = Post.find_by(id: params[:id])
    post.increment!(:compartir,  1)
    auxiliar = post.texto
    Post.where(texto: auxiliar).update_all(compartir: post.compartir)
    rdb = post.dup
    rdb.update_attribute(:cloned, 1)
    rdb.save
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "posts" SET "compartir" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["compartir", 0], ["updated_at", "2020-05-12 17:43:37.035045"], ["id", 3]]
UPDATE "posts" SET "compartir" = ? WHERE "posts"."texto" = ?  [["compartir", 1], ["texto", "Primer Dibb"]]
INSERT INTO "posts" ("texto", "compartir", "likes", "created_at", "updated_at", "user_id", "cloned") VALUES (?, ?, ?, ?, ?, ?, ?)  [["texto", "Primer Dibb"], ["compartir", 1], ["likes", 1], ["created_at", "2020-05-12 20:24:59.147461"], ["updated_at", "2020-05-12 20:24:59.147461"], ["user_id", 2], ["cloned", 1]]